---
kind: property
id: P:Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.SegmentLengthDimensionsForHooksEnabled
source: html/3a6a3be7-5c2a-7d98-f6c6-2c725b25f4aa.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.SegmentLengthDimensionsForHooksEnabled Property

Identifies if segment length dimensions for hooks will be shown or not.
 If this property is true, the SegmentLengthDimensionsEnabled should also be true to see segment length dimensions for hooks.

## Syntax (C#)
```csharp
public bool SegmentLengthDimensionsForHooksEnabled { get; set; }
```